Tekla Open API Reference for Tekla Structures 2025
Events.DrawingReadyForIssuingChangeDelegate Delegate
 The delegate to use for drawing ready for issuing change event.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void DrawingReadyForIssuingChangeDelegate(
	string drawingGuid,
	bool isReady
)
Public Delegate Sub DrawingReadyForIssuingChangeDelegate (
	drawingGuid As String,
	isReady As Boolean
)
Parameters
drawingGuid
Type: System.String
isReady
Type: System.Boolean
See Also
Reference
Tekla.Structures.Drawing Namespace